GopalSaraf/Practicals/PSDL/include/proc/pic16f18146.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x091);
#ifndef _LIB_BUILD
asm("PIR5 equ 091h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2IF                  :1;
        unsigned RC2IF                  :1;
        unsigned SSP1IF                 :1;
        unsigned BCL1IF                 :1;
        unsigned SSP2IF                 :1;
        unsigned BCL2IF                 :1;
        unsigned CM1IF                  :1;
        unsigned CM2IF                  :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x091);
// bitfield macros
#define _PIR5_TX2IF_POSN                                    0x0
#define _PIR5_TX2IF_POSITION                                0x0
#define _PIR5_TX2IF_SIZE                                    0x1
#define _PIR5_TX2IF_LENGTH                                  0x1
#define _PIR5_TX2IF_MASK                                    0x1
#define _PIR5_RC2IF_POSN                                    0x1
#define _PIR5_RC2IF_POSITION                                0x1
#define _PIR5_RC2IF_SIZE                                    0x1
#define _PIR5_RC2IF_LENGTH                                  0x1
#define _PIR5_RC2IF_MASK                                    0x2
#define _PIR5_SSP1IF_POSN                                   0x2
#define _PIR5_SSP1IF_POSITION                               0x2
#define _PIR5_SSP1IF_SIZE                                   0x1
#define _PIR5_SSP1IF_LENGTH                                 0x1
#define _PIR5_SSP1IF_MASK                                   0x4
#define _PIR5_BCL1IF_POSN                                   0x3
#define _PIR5_BCL1IF_POSITION                               0x3
#define _PIR5_BCL1IF_SIZE                                   0x1
#define _PIR5_BCL1IF_LENGTH                                 0x1
#define _PIR5_BCL1IF_MASK                                   0x8
#define _PIR5_SSP2IF_POSN                                   0x4
#define _PIR5_SSP2IF_POSITION                               0x4
#define _PIR5_SSP2IF_SIZE                                   0x1
#define _PIR5_SSP2IF_LENGTH                                 0x1
#define _PIR5_SSP2IF_MASK                                   0x10
#define _PIR5_BCL2IF_POSN                                   0x5
#define _PIR5_BCL2IF_POSITION                               0x5
#define _PIR5_BCL2IF_SIZE                                   0x1
#define _PIR5_BCL2IF_LENGTH                                 0x1
#define _PIR5_BCL2IF_MASK                                   0x20
#define _PIR5_CM1IF_POSN                                    0x6
#define _PIR5_CM1IF_POSITION                                0x6
#define _PIR5_CM1IF_SIZE                                    0x1
#define _PIR5_CM1IF_LENGTH                                  0x1
#define _PIR5_CM1IF_MASK                                    0x40
#define _PIR5_CM2IF_POSN                                    0x7
#define _PIR5_CM2IF_POSITION                                0x7
#define _PIR5_CM2IF_SIZE                                    0x1
#define _PIR5_CM2IF_LENGTH                                  0x1
#define _PIR5_CM2IF_MASK                                    0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x092);
#ifndef _LIB_BUILD
asm("PIR6 equ 092h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned ZCDIF                  :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x092);
// bitfield macros
#define _PIR6_ADIF_POSN                                     0x0
#define _PIR6_ADIF_POSITION                                 0x0
#define _PIR6_ADIF_SIZE                                     0x1
#define _PIR6_ADIF_LENGTH                                   0x1
#define _PIR6_ADIF_MASK                                     0x1
#define _PIR6_ADTIF_POSN                                    0x1
#define _PIR6_ADTIF_POSITION                                0x1
#define _PIR6_ADTIF_SIZE                                    0x1
#define _PIR6_ADTIF_LENGTH                                  0x1
#define _PIR6_ADTIF_MASK                                    0x2
#define _PIR6_ZCDIF_POSN                                    0x2
#define _PIR6_ZCDIF_POSITION                                0x2
#define _PIR6_ZCDIF_SIZE                                    0x1
#define _PIR6_ZCDIF_LENGTH                                  0x1
#define _PIR6_ZCDIF_MASK                                    0x4

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x096);
#ifndef _LIB_BUILD
asm("PIE0 equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTE                   :1;
        unsigned                        :3;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0x096);
// bitfield macros
#define _PIE0_INTE_POSN                                     0x0
#define _PIE0_INTE_POSITION                                 0x0
#define _PIE0_INTE_SIZE                                     0x1
#define _PIE0_INTE_LENGTH                                   0x1
#define _PIE0_INTE_MASK                                     0x1
#define _PIE0_IOCIE_POSN                                    0x4
#define _PIE0_IOCIE_POSITION                                0x4
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x10
#define _PIE0_TMR0IE_POSN                                   0x5
#define _PIE0_TMR0IE_POSITION                               0x5
#define _PIE0_TMR0IE_SIZE                                   0x1
#define _PIE0_TMR0IE_LENGTH                                 0x1
#define _PIE0_TMR0IE_MASK                                   0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x097);
#ifndef _LIB_BUILD
asm("PIE1 equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMIE                  :1;
        unsigned CRCIE                  :1;
        unsigned SCANIE                 :1;
        unsigned ACTIE                  :1;
        unsigned CSWIE                  :1;
        unsigned OSFIE                  :1;
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x097);
// bitfield macros
#define _PIE1_NVMIE_POSN                                    0x0
#define _PIE1_NVMIE_POSITION                                0x0
#define _PIE1_NVMIE_SIZE                                    0x1
#define _PIE1_NVMIE_LENGTH                                  0x1
#define _PIE1_NVMIE_MASK                                    0x1
#define _PIE1_CRCIE_POSN                                    0x1
#define _PIE1_CRCIE_POSITION                                0x1
#define _PIE1_CRCIE_SIZE                                    0x1
#define _PIE1_CRCIE_LENGTH                                  0x1
#define _PIE1_CRCIE_MASK                                    0x2
#define _PIE1_SCANIE_POSN                                   0x2
#define _PIE1_SCANIE_POSITION                               0x2
#define _PIE1_SCANIE_SIZE                                   0x1
#define _PIE1_SCANIE_LENGTH                                 0x1
#define _PIE1_SCANIE_MASK                                   0x4
#define _PIE1_ACTIE_POSN                                    0x3
#define _PIE1_ACTIE_POSITION                                0x3
#define _PIE1_ACTIE_SIZE                                    0x1
#define _PIE1_ACTIE_LENGTH                                  0x1
#define _PIE1_ACTIE_MASK                                    0x8
#define _PIE1_CSWIE_POSN                                    0x4
#define _PIE1_CSWIE_POSITION                                0x4
#define _PIE1_CSWIE_SIZE                                    0x1
#define _PIE1_CSWIE_LENGTH                                  0x1
#define _PIE1_CSWIE_MASK                                    0x10
#define _PIE1_OSFIE_POSN                                    0x5
#define _PIE1_OSFIE_POSITION                                0x5
#define _PIE1_OSFIE_SIZE                                    0x1
#define _PIE1_OSFIE_LENGTH                                  0x1
#define _PIE1_OSFIE_MASK                                    0x20
#define _PIE1_TMR1IE_POSN                                   0x6
#define _PIE1_TMR1IE_POSITION                               0x6
#define _PIE1_TMR1IE_SIZE                                   0x1
#define _PIE1_TMR1IE_LENGTH                                 0x1
#define _PIE1_TMR1IE_MASK                                   0x40
#define _PIE1_TMR1GIE_POSN                                  0x7
#define _PIE1_TMR1GIE_POSITION                              0x7
#define _PIE1_TMR1GIE_SIZE                                  0x1
#define _PIE1_TMR1GIE_LENGTH                                0x1
#define _PIE1_TMR1GIE_MASK                                  0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x098);
#ifndef _LIB_BUILD
asm("PIE2 equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
        unsigned TMR2IE                 :1;
        unsigned TMR4IE                 :1;
        unsigned                        :1;
        unsigned CCP1IE                 :1;
        unsigned CCP2IE                 :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x098);
// bitfield macros
#define _PIE2_TMR3IE_POSN                                   0x0
#define _PIE2_TMR3IE_POSITION                               0x0
#define _PIE2_TMR3IE_SIZE                                   0x1
#define _PIE2_TMR3IE_LENGTH                                 0x1
#define _PIE2_TMR3IE_MASK                                   0x1
#define _PIE2_TMR3GIE_POSN                                  0x1
#define _PIE2_TMR3GIE_POSITION                              0x1
#define _PIE2_TMR3GIE_SIZE                                  0x1
#define _PIE2_TMR3GIE_LENGTH                                0x1
#define _PIE2_TMR3GIE_MASK                                  0x2
#define _PIE2_TMR2IE_POSN                                   0x2
#define _PIE2_TMR2IE_POSITION                               0x2
#define _PIE2_TMR2IE_SIZE                                   0x1
#define _PIE2_TMR2IE_LENGTH                                 0x1
#define _PIE2_TMR2IE_MASK                                   0x4
#define _PIE2_TMR4IE_POSN                                   0x3
#define _PIE2_TMR4IE_POSITION                               0x3
#define _PIE2_TMR4IE_SIZE                                   0x1
#define _PIE2_TMR4IE_LENGTH                                 0x1
#define _PIE2_TMR4IE_MASK                                   0x8
#define _PIE2_CCP1IE_POSN                                   0x5
#define _PIE2_CCP1IE_POSITION                               0x5
#define _PIE2_CCP1IE_SIZE                                   0x1
#define _PIE2_CCP1IE_LENGTH                                 0x1
#define _PIE2_CCP1IE_MASK                                   0x20
#define _PIE2_CCP2IE_POSN                                   0x6
#define _PIE2_CCP2IE_POSITION                               0x6
#define _PIE2_CCP2IE_SIZE                                   0x1
#define _PIE2_CCP2IE_LENGTH                                 0x1
#define _PIE2_CCP2IE_MASK                                   0x40

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x099);
#ifndef _LIB_BUILD
asm("PIE3 equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1PIE                :1;
        unsigned PWM1IE                 :1;
        unsigned PWM2PIE                :1;
        unsigned PWM2IE                 :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0x099);
// bitfield macros
#define _PIE3_PWM1PIE_POSN                                  0x0
#define _PIE3_PWM1PIE_POSITION                              0x0
#define _PIE3_PWM1PIE_SIZE                                  0x1
#define _PIE3_PWM1PIE_LENGTH                                0x1
#define _PIE3_PWM1PIE_MASK                                  0x1
#define _PIE3_PWM1IE_POSN                                   0x1
#define _PIE3_PWM1IE_POSITION                               0x1
#define _PIE3_PWM1IE_SIZE                                   0x1
#define _PIE3_PWM1IE_LENGTH                                 0x1
#define _PIE3_PWM1IE_MASK                                   0x2
#define _PIE3_PWM2PIE_POSN                                  0x2
#define _PIE3_PWM2PIE_POSITION                              0x2
#define _PIE3_PWM2PIE_SIZE                                  0x1
#define _PIE3_PWM2PIE_LENGTH                                0x1
#define _PIE3_PWM2PIE_MASK                                  0x4
#define _PIE3_PWM2IE_POSN                                   0x3
#define _PIE3_PWM2IE_POSITION                               0x3
#define _PIE3_PWM2IE_SIZE                                   0x1
#define _PIE3_PWM2IE_LENGTH                                 0x1
#define _PIE3_PWM2IE_MASK                                   0x8

